---
type: DockableFrameVisibilityChangedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DockableFrameVisibilityChangedEventArgs

`Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DockableFrameShown | 2015 | `public bool DockableFrameShown { get ; }` |
| Property | PaneId | 2015 | `public DockablePaneId PaneId { get ; }` |